[
    {
        "title":  "Registration",
        "Speaker":  "None",
        "StartTime":  "2018-04-17 08:00:00",
        "Type":  "Conf",
        "Track":  0,
        "Slot":  1,
        "abstract":  "Get your badge and materials",
        "Duration":  60,
        "Category":  "All",
        "ID":  1
    },
    {
        "title":  "Opening Ceremony",
        "Speaker":  "Tobias Weltner",
        "StartTime":  "2018-04-17 09:00:00",
        "Type":  "Presentation",
        "Track":  1,
        "Slot":  2,
        "abstract":  "Grand Conference Opening",
        "Duration":  60,
        "Category":  "All",
        "ID":  2
    },
    {
        "title":  "PowerShell 2018 - State of the Art (Keynote)",
        "Speaker":  "Jeffrey Snover",
        "StartTime":  "2018-04-17 09:30:00",
        "Type":  "Presentation",
        "Track":  1,
        "Slot":  3,
        "abstract":  "This talk covers the transition from Windows PowerShell to Core PowerShell.  It reviews the forces and thinking behind this change and discusses what has gone well, what could have gone better, where we are and where things are going.",
        "Duration":  60,
        "Category":  "PowerShell",
        "ID":  3
    },
    {
        "title":  "Managing your heterogeneous environments with PowerShell Core 6.0 and Win32-OpenSSH",
        "Speaker":  "Joey Aiello",
        "StartTime":  "2018-04-17 11:00:00",
        "Type":  "Presentation",
        "Track":  1,
        "Slot":  4,
        "abstract":  "Join us to learn how to managie your heterogeneous environments with PowerShell Core 6.0 and Win32-OpenSSH",
        "Duration":  60,
        "Category":  "Security",
        "ID":  4
    },
    {
        "title":  "RegEx ^3\\.0$ - The Outer Edge",
        "Speaker":  "Mathias Jessen",
        "StartTime":  "2018-04-17 11:00:00",
        "Type":  "Presentation",
        "Track":  2,
        "Slot":  4,
        "abstract":  "At PSConfEU17 we talked a bit about regex, and some of its common applications. This year, we\u0027ll crank it up to 11 and dive straight-first into some of the most bizarre functions .NET regex has to offer. These are the solutions you won\u0027t stumble upon in every other forum post, the outer edge cases!",
        "Duration":  60,
        "Category":  "PowerShell",
        "ID":  5
    },
    {
        "title":  "Using Chat Automation (ChatOps)",
        "Speaker":  "Jaap Brasser",
        "StartTime":  "2018-04-17 11:00:00",
        "Type":  "Presentation",
        "Track":  3,
        "Slot":  4,
        "abstract":  "Chat automation has been a persistent buzz in the industry: ChatOps is a term used to describe bringing development or operations work that is already happening in the background into a common chat room. It involves having everyone in the team in a single chat room, then bringing tools into the room so everyone can automate, collaborate and see how automation is used to solve problems. In doing so, you are unifying the communication about what work gets done and have a history of it happening.\nIn this session we will go through setting up Chat automation using PowerShell, how to hit the ground running and what steps to take to convert your existing code base and make it work from Chat. From there on we will dive into how we can securely deploy, manage and administer this as a platform. Expect a session filled with demos and real-world insights of bringing this live in a production environment.",
        "Duration":  60,
        "Category":  "Fun",
        "ID":  6
    },
    {
        "title":  "Containers! Where is my PowerShell?",
        "Speaker":  "Jan Egil Ring",
        "StartTime":  "2018-04-17 13:00:00",
        "Type":  "Presentation",
        "Track":  1,
        "Slot":  5,
        "abstract":  "In this session you will see how PowerShell fits into the era of containers - both for management purposes and for running inside containers. We will look at container orchestration as well as operations tasks - covering both Linux and Windows containers. Be prepared - there will be lots of demos!",
        "Duration":  60,
        "Category":  "DevOps",
        "ID":  7
    },
    {
        "title":  "PowerShell Core 6 auf Linux. Und was mach ich jetzt damit auf Linux?",
        "Speaker":  "Dr. H. Schwichtenberg",
        "StartTime":  "2018-04-17 13:00:00",
        "Type":  "Presentation",
        "Track":  2,
        "Slot":  5,
        "abstract":  "Warum sollte ich aber auf Linux mit der PowerShell statt der bash arbeiten wollen? Dr. Holger Schwichtenberg zeigt die PowerShell Core in Action auf Linux, weißt aber auch darauf hin, welche Befehle aus der Windows PowerShell auf Linux noch fehlen.",
        "Duration":  60,
        "Category":  "Core",
        "ID":  8
    },
    {
        "title":  "The DSC Pull Server is dead, long live the DSC Pull Server",
        "Speaker":  "Ben Gelens",
        "StartTime":  "2018-04-17 13:00:00",
        "Type":  "Presentation",
        "Track":  3,
        "Slot":  5,
        "abstract":  "Ben presents first look at how DSC functionality has changed. Since the dust hasn\u0027t yet settled on this topic, expect a lot of cutting edge information that can\u0027t be summarized in this abstract yet.",
        "Duration":  60,
        "Category":  "DevOps",
        "ID":  9
    },
    {
        "title":  "Red vs. Blue – Ready, Steady, Fight!",
        "Speaker":  "Julien Reisdorffer, David das Neves",
        "StartTime":  "2018-04-17 14:15:00",
        "Type":  "Presentation",
        "Track":  1,
        "Slot":  6,
        "abstract":  "Julien \u0026 David will show in this very technical but thrilling session commonly used attack techniques using PowerShell and possible countermeasures focusing on Win10 to provide very technical insights. Are you even aware of the defensive stack or have you just lost the race? It´s time to figure out.",
        "Duration":  60,
        "Category":  "Security",
        "ID":  10
    },
    {
        "title":  "The Extended Type System",
        "Speaker":  "Staffan Gustafsson",
        "StartTime":  "2018-04-17 14:15:00",
        "Type":  "Presentation",
        "Track":  2,
        "Slot":  6,
        "abstract":  "A deep dive into the PowerShell type system. What it can and cannot do, how it works, a peek at how it is implemented and examples on how you can use it to adapt standard and third party types to your own situation and workflow.  ",
        "Duration":  60,
        "Category":  "PowerShell",
        "ID":  11
    },
    {
        "title":  "How to become a PowerShell Type System Ninja! (Part 1)",
        "Speaker":  "Mathias Jessen",
        "StartTime":  "2018-04-17 14:15:00",
        "Type":  "Presentation",
        "Track":  3,
        "Slot":  6,
        "abstract":  "This is part 1 of a 2-part hot session focusing on two exciting topics:\n1) Exploring the type system using simple tools like powershell.exe and PSReadLine.\n2) Generating and emitting types at runtime using just powershell - no C# skills needed! \nAttendees will be empowered by ETS and riches hiding right beneath their feet!\nIf you liked what you have seen in this session, come to part 2 tomorrow to dig deeper!",
        "Duration":  60,
        "Category":  "DevOps",
        "ID":  12
    },
    {
        "title":  "Securing your infrastructure with JEA",
        "Speaker":  "Miriam Wiesner",
        "StartTime":  "2018-04-17 15:30:00",
        "Type":  "Presentation",
        "Track":  1,
        "Slot":  7,
        "abstract":  "If you don\u0027t know JEA yet, this is your chance to catch up: What is JEA and how can it help you securing your infrastructure (+Tiering model)? How does it work? Which components are there and how to deploy? Use Cases on JEA Insecure configurations/exploiting risky JEA configuration",
        "Duration":  60,
        "Category":  "",
        "ID":  13
    },
    {
        "title":  "TFS and VSTS through Infrastructure as Code",
        "Speaker":  "Jeff Wouters",
        "StartTime":  "2018-04-17 15:30:00",
        "Type":  "Presentation",
        "Track":  2,
        "Slot":  7,
        "abstract":  "Why not view TFS and/or VSTS as part of your infrastructure, because the are...? Then, why no apply Infrastructure as Code to them? This is what my customer and I were thinking, and I\u0027ll show you just what we did and the obstacles we needed to overcome.",
        "Duration":  60,
        "Category":  "DevOps",
        "ID":  14
    },
    {
        "title":  "How we made Configurable Pester Tests for SQL Server",
        "Speaker":  "Chrissy LeMaire, Rob Sewell",
        "StartTime":  "2018-04-17 15:30:00",
        "Type":  "Presentation",
        "Track":  3,
        "Slot":  7,
        "abstract":  "We love using Pester to validate our SQL Server estate but to enable this to be shared we needed to make our Pester tests easily configurable. Join MVPs Chrissy LeMaire and Rob Sewell as they show \nthe technical processes that we used to do this\nhow we use AST in our unit tests to ensure that new tests follow our guidelines\nhow you can use Power Bi to display your Pester Test Results",
        "Duration":  60,
        "Category":  "Pester",
        "ID":  15
    },
    {
        "title":  "Invoke-CypherDog - Bloodhound Dog Whispering with PowerShell",
        "Speaker":  "Walter Legowski",
        "StartTime":  "2018-04-17 16:45:00",
        "Type":  "Presentation",
        "Track":  1,
        "Slot":  8,
        "abstract":  "Bloodhound is an Active Directory object relationship graphing tool used for situational awareness in offensive AD security testing. \nOriginally designed by red teamers for red teamers, it can also be very useful to blue teams and regular admins. \nIn this session we will introduce the tool itself and its basic concepts and functionalities. \nI will then present a PowerShell module made to interact with the Bloodhound database via the REST API, allowing you to become a real Dog Whisperer, \nand making it possible to connect other tools to bloodhound for further automation... This session is aimed at you even if you don\u0027t like dogs.",
        "Duration":  60,
        "Category":  "Security",
        "ID":  16
    },
    {
        "title":  "Was ein PowerShell-Nutzer über .NET wissen MUSS!",
        "Speaker":  "Dr. H. Schwichtenberg",
        "StartTime":  "2018-04-17 16:45:00",
        "Type":  "Presentation",
        "Track":  2,
        "Slot":  8,
        "abstract":  ".NET-Guru Dr. Holger Schwichtenberg erklärt in diesem Vortrag einige Konzepte von .NET, die Ihnen helfen, noch deutlich mehr aus der PowerShell herauszuholen. Er zeigt dabei auch, wie man .NET-basierte Anwendungen fernsteuern kann.",
        "Duration":  60,
        "Category":  "PowerShell",
        "ID":  17
    },
    {
        "title":  "OVF - getting fun from boring tasks",
        "Speaker":  "Mateusz Czerniawski",
        "StartTime":  "2018-04-17 16:45:00",
        "Type":  "Presentation",
        "Track":  3,
        "Slot":  8,
        "abstract":  "Ever wanted to make manual checklists obsolete and auto-generated reports content rich? Demo heavy session about making easy validating your environment with OVF. Real life examples of maintenance burden solved. Testing AD, DHCP, S2D clusters for operational status or configuration drifts!",
        "Duration":  60,
        "Category":  "Pester",
        "ID":  18
    },
    {
        "title":  "Getting Ready for Workshops",
        "Speaker":  "All",
        "StartTime":  "2018-04-17 17:45:00",
        "Type":  "Discussion",
        "Track":  1,
        "Slot":  9,
        "abstract":  "In this quick sessions, we introduce the workshops taking place tomorrow. You get a chance to learn more about the workshop content, and prerequisites that you may need to download onto your notebook in advance. Important: Since workshop seats are limited, you also get a chance to submit your workshop preferences during this session. By submitting your preferences, you have the chance to get a reserved seat. Anyone not attending this session is limited to the workshop seats still available when the workshops open.",
        "Duration":  "30",
        "Category":  "All",
        "ID":  19
    },
    {
        "title":  "Zoo Evening Event",
        "Speaker":  "All",
        "StartTime":  "2018-04-17 18:30:00",
        "Type":  "Event",
        "Track":  0,
        "Slot":  10,
        "abstract":  "Evening Event at the Zoo Hanover. We spend all evening with drinks and dinner together in Yukon Bay. Bring your badge to get in!",
        "Duration":  "390",
        "Category":  "All",
        "ID":  20
    },
    {
        "title":  "PowerShell Engine Internals ",
        "Speaker":  "Dongbo Wang",
        "StartTime":  "2018-04-18 08:30:00",
        "Type":  "Presentation",
        "Track":  1,
        "Slot":  1,
        "abstract":  "An architecture overview of the PowerShell engine internals.",
        "Duration":  60,
        "Category":  "PowerShell",
        "ID":  21
    },
    {
        "title":  "Saving Mr Typo: Authoring Tab Expansions with TabExpansionPlusPlus",
        "Speaker":  "Bartosz Bielawski",
        "StartTime":  "2018-04-18 08:30:00",
        "Type":  "Presentation",
        "Track":  2,
        "Slot":  1,
        "abstract":  "Is Mr Typo your second name? Or perhaps you are surrounded by people that seem to mistype everything they can? If you want to fix either of these problems, join me for training session where we will learn how to author dynamic tab expansions in TabExpansionPlusPlus module for PowerShell 3 and above.",
        "Duration":  60,
        "Category":  "PowerShell",
        "ID":  22
    },
    {
        "title":  "Case of the Unexplained - PowerShell Edition",
        "Speaker":  "Daniël Both",
        "StartTime":  "2018-04-18 08:30:00",
        "Type":  "Presentation",
        "Track":  3,
        "Slot":  1,
        "abstract":  "We all have been there, your script generates unexpected output. Join this session to find out which tools exist to debug your PowerShell scripts. As with all of the Case of the Unexplained sessions, this session is focused at how to come to a solution.",
        "Duration":  60,
        "Category":  "Fun",
        "ID":  23
    },
    {
        "title":  "Game of Automation Thrones",
        "Speaker":  "Aleksandar Nikolic",
        "StartTime":  "2018-04-18 09:45:00",
        "Type":  "Presentation",
        "Track":  1,
        "Slot":  2,
        "abstract":  "Join us to learn more about different Azure automation technologies and pick your winner.",
        "Duration":  60,
        "Category":  "Azure",
        "ID":  24
    },
    {
        "title":  "Somewhat Advanced dbatools Development",
        "Speaker":  "Chrissy LeMaire, Friedrich Weinmann",
        "StartTime":  "2018-04-18 09:45:00",
        "Type":  "Presentation",
        "Track":  2,
        "Slot":  2,
        "abstract":  "Join dbatools creator Chrissy LeMaire and architect Friedrich Weinmann for a view behind the technical scenes, to see how we help simplify development for our contributors and keep the project exciting for both beginners and pros.",
        "Duration":  60,
        "Category":  "Database",
        "ID":  25
    },
    {
        "title":  "How to become a PowerShell Type System Ninja! (Part 2",
        "Speaker":  "Mathias Jessen",
        "StartTime":  "2018-04-18 09:45:00",
        "Type":  "Presentation",
        "Track":  3,
        "Slot":  2,
        "abstract":  "2-part talk that covers two exciting topics:   1) Exploring the type system using simple tools like powershell.exe and PSReadLine 2) Generating and emitting types at runtime using just powershell - no C# skills needed!  Attendees will be empowered by ETS and riches hiding right beneath their feet!",
        "Duration":  60,
        "Category":  "PowerShell",
        "ID":  26
    },
    {
        "title":  "Hands-on JEA",
        "Speaker":  "Jan-Hendrik Peters, Raimund Andree",
        "StartTime":  "2018-04-18 11:00:00",
        "Type":  "Presentation",
        "Track":  1,
        "Slot":  3,
        "abstract":  "By now you have heard of Just Enough Administration - but have you actually configured it yet? In this training session we will delve into creating JEA endpoints for various purposes - from typical Help Desk scenarios to DSC node self-registration!",
        "Duration":  60,
        "Category":  "Security",
        "ID":  27
    },
    {
        "title":  "Desired State: A close look at the PowerShell and DSC integrations with Chef",
        "Speaker":  "Stuart Preston",
        "StartTime":  "2018-04-18 11:00:00",
        "Type":  "Presentation",
        "Track":  2,
        "Slot":  3,
        "abstract":  "Want to know how the Chef interacts with PowerShell and DSC on the Windows platform? We’re going to take a advanced level look at what you can do, tips and tricks to set you up for success and how using Chef’s open source toolset improves the testability, reliability and lowers implementation risk.  ",
        "Duration":  60,
        "Category":  "DevOps",
        "ID":  28
    },
    {
        "title":  "Pester internals and concepts",
        "Speaker":  "Jakub Jareš",
        "StartTime":  "2018-04-18 11:00:00",
        "Type":  "Presentation",
        "Track":  3,
        "Slot":  3,
        "abstract":  "You learned the syntax of Pester and now you wonder what is behind it? Or maybe, you prefer learning from the bottom up? In any case join me for this session and I will show you the basic building blocks of Pester,  the mechanisms used and how they are implemented.",
        "Duration":  60,
        "Category":  "Pester",
        "ID":  29
    },
    {
        "title":  "Revoke-Obfuscation: PowerShell Obfuscation Detection (And Evasion) Using Science",
        "Speaker":  "Daniel Bohannon ",
        "StartTime":  "2018-04-18 13:00:00",
        "Type":  "Presentation",
        "Track":  1,
        "Slot":  4,
        "abstract":  "Red Teams and nation state threat actors alike are using PowerShell obfuscation to evade detection. Come see how the author of Invoke-Obfuscation and one of the original PowerShell developers tackle detecting obfuscation with PowerShell\u0027s Abstract Syntax Tree and science in Revoke-Obfuscation.",
        "Duration":  60,
        "Category":  "Security",
        "ID":  30
    },
    {
        "title":  "Automate everything: Bring self-service to LEGO robots",
        "Speaker":  "Jakob Gottlieb Svendsen",
        "StartTime":  "2018-04-18 13:00:00",
        "Type":  "Presentation",
        "Track":  2,
        "Slot":  4,
        "abstract":  "This is fun! Doing self service for LEGO robots? What can be more existing and useful than that!",
        "Duration":  60,
        "Category":  "Fun",
        "ID":  31
    },
    {
        "title":  "Configurations, Personalities, and Stamps - Modular approach to realizing the deployment pipeline",
        "Speaker":  "Ravikanth Chaganti",
        "StartTime":  "2018-04-18 13:00:00",
        "Type":  "Presentation",
        "Track":  3,
        "Slot":  4,
        "abstract":  "Realizing a completely automated infrastructure deployment pipeline can be much easier when built in a modular way. This session shows how to build one using what we know best -- PowerShell, DSC, and Pester.",
        "Duration":  60,
        "Category":  "DevOps",
        "ID":  32
    },
    {
        "title":  "DSC in Azure Automation: Run configuration and orchestration as a cloud service",
        "Speaker":  "Michael Greene",
        "StartTime":  "2018-04-18 14:15:00",
        "Type":  "Presentation",
        "Track":  1,
        "Slot":  5,
        "abstract":  "DSC in Azure Automation: Run configuration and orchestration as a cloud service",
        "Duration":  60,
        "Category":  "DevOps",
        "ID":  33
    },
    {
        "title":  "PowerShell, Reflection, and the Windows API",
        "Speaker":  "Jared Atkinson",
        "StartTime":  "2018-04-18 14:15:00",
        "Type":  "Presentation",
        "Track":  2,
        "Slot":  5,
        "abstract":  "Want to extend PowerShell and the .NET Framework it rides on? This talk will show you how to interact with the Windows API in memory without the need to compile C# source code and contribute back to the community by documenting the API functions you use in your code.",
        "Duration":  60,
        "Category":  "PowerShell",
        "ID":  34
    },
    {
        "title":  "Infrastructure validation using Pester",
        "Speaker":  "Irwin Strachan",
        "StartTime":  "2018-04-18 14:15:00",
        "Type":  "Presentation",
        "Track":  3,
        "Slot":  5,
        "abstract":  "Still using manual checklists? Think it\u0027s time for some Operation Validation using Pester!",
        "Duration":  60,
        "Category":  "Pester",
        "ID":  35
    },
    {
        "title":  "Convert your Windows PowerShell module to be compatible with PowerShell Core 6.x",
        "Speaker":  "Wojciech Sciesinski",
        "StartTime":  "2018-04-18 15:30:00",
        "Type":  "Presentation",
        "Track":  1,
        "Slot":  6,
        "abstract":  "During the presentation, I would like to share my experiences with working on the modification of existing Windows PowerShell modules to work with PowerShell Core 6.x on all supported platforms (Windows, Linux, MacOS). I will present the main areas which need to be checked and/or adjusted.",
        "Duration":  60,
        "Category":  "Core",
        "ID":  36
    },
    {
        "title":  "PowerShell Yin-Yang: The Worst Practices and Tips \u0026 Tricks",
        "Speaker":  "Bartosz Bielawski",
        "StartTime":  "2018-04-18 15:30:00",
        "Type":  "Presentation",
        "Track":  2,
        "Slot":  6,
        "abstract":  "Every Yin has its Yang. Every Jedi has her Sith. Every bad practice can be balanced with an awesome trick. Join me to see the darkest places of PowerShell scripting universe so that you know what to avoid! Get to know tricks that will impress your peers and tips that will make your life easier!",
        "Duration":  60,
        "Category":  "Fun",
        "ID":  37
    },
    {
        "title":  "Release Pipeline - the PPoSh Modules Story",
        "Speaker":  "Mateusz Czerniawski",
        "StartTime":  "2018-04-18 15:30:00",
        "Type":  "Presentation",
        "Track":  3,
        "Slot":  6,
        "abstract":  "How an average Ops can benefit from mysterious Release Pipiline. How GIT and a CI server allows to get greater confidence in your code? Use cases of AppVeyor and TeamCity in Objectivity Ecosystem for OS PPoSh modules and internal Ops Daily Blood.",
        "Duration":  60,
        "Category":  "DevOps",
        "ID":  38
    },
    {
        "title":  "Getting Ready for Workshops",
        "Speaker":  "All",
        "StartTime":  "2018-04-18 16:30:00",
        "Type":  "Discussion",
        "Track":  1,
        "Slot":  7,
        "abstract":  "If you have a reserved workshop seat, please go to the workshop you signed up for. If you do not have a reserved seat, at each workshop you find a list of available seats. Add yourself to the workshop list of choice, and make yourself at home.",
        "Duration":  "30",
        "Category":  "All",
        "ID":  39
    },
    {
        "title":  "Workshop: The Power of the Dark Side: Offensive PowerShell Workshop",
        "Speaker":  "Will Schroeder,Jared Atkinson",
        "StartTime":  "2018-04-18 17:00:00",
        "Type":  "Workshop",
        "Track":  1,
        "Slot":  8,
        "abstract":  "Have you ever wanted to play with hacking tools, or wanted to know how attackers use PowerShell offensively? In this workshop I will introduce a number of offensive PowerShell toolsets, many of which I helped develop or co-author. \nIntro and Setup\nInvoke-Mimikatz\nDefending against (Invoke-)Mimikatz\n  -Sysmon events\n  -PowerShell logging\n  -Detecting Invoke-Mimikatz\nAlternate PowerShell Hosts\n -Searching for alternate PowerShell hosts\n -Abusing \"official\" alternate PowerShell hosts\n -Abusing alternate PowerShell hosts\n-PowerShell Injection\n -PowerShell without powershell.exe\n  -UnmanagedPowerShell\n -Invoke-PSInject (what Empire is based on)\n -PowerShell in unmanaged code\n -Detecting PowerShell injection\n  -WMI module load events\n  -Sysmon events\n  -PowerShell logging\n  -Get-InjectedThread\n -Detecting \"PowerShell without powershell.exe\"\n-Wrapup",
        "Duration":  "180",
        "Category":  "Security",
        "ID":  40
    },
    {
        "title":  "Workshop: PlatyPS: From 0 to 1 and beyond",
        "Speaker":  "Sergei Vorobev",
        "StartTime":  "2018-04-18 17:00:00",
        "Type":  "Workshop",
        "Track":  2,
        "Slot":  8,
        "abstract":  "Do you suffer from un(der)documented PowerShell code? Or, is it your hair that is constantly on fire, and you simply do not have the time to add proper documentation to your code? That’s common place, look around - yet it’s not very clever. PowerShell scripts become integral part of your business logic. Without documentation, you waste time for others to service your code, and may even violate legal requirements. As a professional PowerShell scripter, you want to make sure your code is accompanied by professional-looking and complete documentation. Just how do you approach this?\nLean back, join this workshop, and become friends with PlatyPS! PlatyPS is the new tool used by both Microsoft and Community that help you to create professional documentation for your PowerShell projects in no time:\n• Just how do you (quickly) add good documentation to your existing code? PlatyPS is the answer: fast bootstrapping for existing projects!\n• How can documentation show both in the PowerShell help system, and can be published to websites? PlatyPS is the answer: compatible both with maml and markdown, documentation displays in PS help system and on websites\n• How do you maintain and update your documentation with new versions of your code, and new functions or new parameters introduced? PlatyPS is the answer: version control friendly documentation, support for updating existing help\n• Finally: how do you work as a team? PlatyPS is the answer: enable others to contribute to your documentation with ease.\nPlatyPS adds the professional touch to your PS projects, and is completely free. Join the list of these popular modules that already use platyPS: Azure-Powershell, Powershell-Docs, PSReadLine.\nIn this workshop we will cover:\n• onboarding for an existing project (bring your own or use a sample one!)\n• standard workflow for platyPS: creating new help, updating help, creating maml from markdown.\n• hosting your markdown documentation.\n• best practices of markdown authoring.\n• Continuous Integration - never have out-of-date documentation again! \n• How comment-based help benefits from platyPS.\nAs a bonus we will talk about few advanced topics that haven’t been widely discussed before:\n• support for multiple versions in a single file.\n• localization story.\nCome and join the movement to modernize the powershell help!",
        "Duration":  "180",
        "Category":  "PowerShell",
        "ID":  41
    },
    {
        "title":  "Workshop: Bring Existing Infrastructure under Code Control",
        "Speaker":  "Matthew Hitchcock, Gael Colas, Jan-Hendrik Peters, Raimund Andree",
        "StartTime":  "2018-04-18 17:00:00",
        "Type":  "Workshop",
        "Track":  3,
        "Slot":  8,
        "abstract":  "In this workshop, we\u0027ll work out how to successfully bring an existing infrastructure under code control, and the associated workflow required to make it reliable in a real-life scenario. \n \nThis is the perfect chance to hop on the train if you ever wondered what DSC is, how it can help you better manage infrastructure, and what a “Release Pipeline” is. The workshop provides much practical knowhow even for those who already work with DSC.\n \nWe’ll first review the underpinning principles of managing infrastructure in a robust and trustworthy way. Then, step by step, we demonstrate how an existing infrastructure can be defined, put under DSC control, and changes deployed. We\u0027ll guide you through a quick setup of a representative lab of a legacy infrastructure with a domain and few services. We\u0027ll introduce our Continuous Integration (CI) tool, a VSTS instance, and create our build pipeline for PowerShell modules, introduce the concepts and replicate the learnings to other pipelines used in Infrastructure management. \n \nWe\u0027ll then start composing our DSC solution by composing Configurations and Resources into roles, to change our pets into cattle, adopting a flexible configuration data model defining the infrastructure similar to Puppet, Chef and Ansible.\nAttendees are free to follow along and deploy the solution in their own Azure Resource Group. By running the demo code they will experience first-hand how change is promoted throughout the staging rings, from Dev to Prod, and how the puzzle fits together. At the end of this workshop, you’ll have made friends with DSC and know how to tackle your own infrastructure.",
        "Duration":  "180",
        "Category":  "DevOps",
        "ID":  42
    },
    {
        "title":  "Auditing Domain Trust Relationships",
        "Speaker":  "Will Schroeder",
        "StartTime":  "2018-04-19 08:30:00",
        "Type":  "Presentation",
        "Track":  1,
        "Slot":  1,
        "abstract":  "Does your organization have one or more Active Directory domain trusts? Can you guarantee that your trust “mesh” is configured correctly? This talk will explain domain trusts in depth and show how they can be easily audited from an defensive or offensive perspective with PowerShell/PowerView.",
        "Duration":  60,
        "Category":  "Security",
        "ID":  43
    },
    {
        "title":  "PowerShell for SharePoint Online - How DevOps is making SharePoint Admins feel loved again",
        "Speaker":  "Rick Taylor",
        "StartTime":  "2018-04-19 08:30:00",
        "Type":  "Presentation",
        "Track":  2,
        "Slot":  1,
        "abstract":  "For years admins have been performing repetitive tasks - even with the advent of PowerShell, they still repeat many tasks over and over.    This session helps SharePoint admins understand the \"Dev\" in DevOps \u0026 understand the CD approach \u0026 give them practical guidance they can implement immediately.",
        "Duration":  60,
        "Category":  "Sharepoint",
        "ID":  44
    },
    {
        "title":  "Dependencies, how to make them evident",
        "Speaker":  "Irwin Strachan",
        "StartTime":  "2018-04-19 08:30:00",
        "Type":  "Presentation",
        "Track":  3,
        "Slot":  1,
        "abstract":  "Assumptions is the mother of all screw-ups. Making dependencies evident will keep your assumptions in check!",
        "Duration":  60,
        "Category":  "PowerShell",
        "ID":  45
    },
    {
        "title":  "The PowerShell Security Best Practice Live Demo! (Part 1)",
        "Speaker":  "David das Neves, Julien Reisdorffer, Raimund Andree, Miriam Wiesner",
        "StartTime":  "2018-04-19 09:45:00",
        "Type":  "Presentation",
        "Track":  1,
        "Slot":  2,
        "abstract":  "PowerShell Security is a very huge topic with many dependencies and technologies. Why not showing a -complete- Best Practice environment?  In this double-session we will set up with you -on-hands- a complete environment and go through all Security Best Practices!  Join us for a geat live-demo!",
        "Duration":  60,
        "Category":  "Security",
        "ID":  46
    },
    {
        "title":  "Continuous Delivery for your Module to the PowerShell Gallery",
        "Speaker":  "Rob Sewell",
        "StartTime":  "2018-04-19 09:45:00",
        "Type":  "Presentation",
        "Track":  2,
        "Slot":  2,
        "abstract":  "An intro session to show how to deploy a PowerShell module with CD  In this fast paced demo heavy session we will  - Use Plaster  - Use GitHub  - Use Pester  - Use VSTS to Build, Test  \u0026 Release   All using a module that uses the Microsoft Cognitive Services Faces API to analyse Beards!",
        "Duration":  60,
        "Category":  "PowerShell",
        "ID":  47
    },
    {
        "title":  "Manage servers using configuration as code",
        "Speaker":  "Michael Greene",
        "StartTime":  "2018-04-19 09:45:00",
        "Type":  "Presentation",
        "Track":  3,
        "Slot":  2,
        "abstract":  "Manage servers using configuration as code",
        "Duration":  60,
        "Category":  "Azure",
        "ID":  48
    },
    {
        "title":  "The PowerShell Security Best Practice Live Demo! (Part 2)",
        "Speaker":  "David das Neves, Julien Reisdorffer, Raimund Andree, Miriam Wiesner",
        "StartTime":  "2018-04-19 10:50:00",
        "Type":  "Presentation",
        "Track":  1,
        "Slot":  3,
        "abstract":  "PowerShell Security is a very huge topic with many dependencies and technologies. Why not showing a -complete- Best Practice environment?  In this double-session we will set up with you -on-hands- a complete environment and go through all Security Best Practices!  Join us for a geat live-demo!",
        "Duration":  60,
        "Category":  "Security",
        "ID":  49
    },
    {
        "title":  "Be the automator - not the automated",
        "Speaker":  "Jan Egil Ring",
        "StartTime":  "2018-04-19 10:50:00",
        "Type":  "Presentation",
        "Track":  2,
        "Slot":  3,
        "abstract":  "In this session we will look at some key concepts around DevOps and tooling before diving into demos showing examples on what processes and tools can be used for automation. Azure Automation, Azure Logic Apps and Microsoft PowerApps is some of the technologies you will get to see in this session.",
        "Duration":  60,
        "Category":  "Azure",
        "ID":  50
    },
    {
        "title":  "PowerShell in Azure Cloud Shell",
        "Speaker":  "Aleksandar Nikolic",
        "StartTime":  "2018-04-19 10:50:00",
        "Type":  "Presentation",
        "Track":  3,
        "Slot":  3,
        "abstract":  "Join us to learn how to make creation and management of Azure resources cool again. Enjoy the power of command-line directly in your browser!",
        "Duration":  60,
        "Category":  "Azure",
        "ID":  51
    },
    {
        "title":  "A Historical Architectural Tour of PowerShell (Part 1)",
        "Speaker":  "Bruce Payette",
        "StartTime":  "2018-04-19 12:35:00",
        "Type":  "Presentation",
        "Track":  1,
        "Slot":  4,
        "abstract":  "Join us for a look at how PowerShell has evolved over time. We\u0027ll look at both the technical and environmental drivers behind many of the decisions that made PowerShell what it is today. This is part 1 of a two part presentation.",
        "Duration":  60,
        "Category":  "",
        "ID":  52
    },
    {
        "title":  "Navigate around the edge with PowerShell",
        "Speaker":  "Jaap Brasser",
        "StartTime":  "2018-04-19 12:35:00",
        "Type":  "Presentation",
        "Track":  2,
        "Slot":  4,
        "abstract":  "Working with PowerShell is often a joyous occasion, working with the latest and greatest technologies. Remoting from Linux to Windows and back again with the greatest ease, it is an interesting time to be involved with PowerShell.",
        "Duration":  60,
        "Category":  "Core",
        "ID":  53
    },
    {
        "title":  "Automate automating your automation, DSC with class-defined metadata",
        "Speaker":  "Daniël Both",
        "StartTime":  "2018-04-19 12:35:00",
        "Type":  "Presentation",
        "Track":  3,
        "Slot":  4,
        "abstract":  "Would you like to use DSC in your environment, or are you looking for a way to automate your DSC configurations? Join us in this session where we present a way to parameterize, test and automate your DSC configurations.",
        "Duration":  60,
        "Category":  "DevOps",
        "ID":  54
    },
    {
        "title":  "A Historical Architectural Tour of PowerShell (Part 2)",
        "Speaker":  "Bruce Payette",
        "StartTime":  "2018-04-19 13:45:00",
        "Type":  "Presentation",
        "Track":  1,
        "Slot":  5,
        "abstract":  "Join us for a look at how PowerShell has evolved over time. We\u0027ll look at both the technical and environmental drivers behind many of the decisions that made PowerShell what it is today. This is part 2 of a two part presentation.",
        "Duration":  60,
        "Category":  "",
        "ID":  55
    },
    {
        "title":  "PowerShell Formatting",
        "Speaker":  "Staffan Gustafsson",
        "StartTime":  "2018-04-19 13:45:00",
        "Type":  "Presentation",
        "Track":  2,
        "Slot":  5,
        "abstract":  "Formatting is what happens at the end of each pipeline, where objects are rendered into a text representation.\nThis session will look at the formatting engine in PowerShell, it’s capabilities and it’s some of it’ weaknesses.\nWe will dive into how to customize how objects from a module are formatted, including how to render a collection member.\nLastly, a peek at a possible future of formatting, a new approach with better performance – PSMore.\n\nThe session will be require a working knowledge of PowerShell, and will at occasions look at C# underpinnings.\n",
        "Duration":  60,
        "Category":  "PowerShell",
        "ID":  56
    },
    {
        "title":  "DSC in Configuration Management tool world",
        "Speaker":  "Ben Gelens",
        "StartTime":  "2018-04-19 13:45:00",
        "Type":  "Presentation",
        "Track":  3,
        "Slot":  5,
        "abstract":  "DSC on it\u0027s own is a great platform but what is lacking is a nice of the shelf management solution and a bit of maturity. In this session I\u0027ll look at working with cm tooling like Chef and Puppet in combination with DSC to see where these CM tools enrich the DSC experience",
        "Duration":  60,
        "Category":  "DevOps",
        "ID":  57
    },
    {
        "title":  "PowerShell Core 6.1 and beyond",
        "Speaker":  "Steve Lee",
        "StartTime":  "2018-04-19 14:55:00",
        "Type":  "Presentation",
        "Track":  1,
        "Slot":  6,
        "abstract":  "Discuss the PowerShell Core 6.1 goals, road map, current progress, and demos of works-in-progress.  ",
        "Duration":  60,
        "Category":  "Core",
        "ID":  58
    },
    {
        "title":  "Werde zum XML Ninja mit PowerShell",
        "Speaker":  "Andreas Nick",
        "StartTime":  "2018-04-19 14:55:00",
        "Type":  "Presentation",
        "Track":  2,
        "Slot":  6,
        "abstract":  "XML als Datenspeicher oder als einfache Datenbank in Form einer Textdatei wird häufig in der PowerShell genutzt. In dieser Session kannst Du lernen, wie Du XML optimaler nutzen kannst.Bsp. über XPATH nach Elementen oder nach XML Attributen suchen, Umgang mit Namensräumen usw.",
        "Duration":  60,
        "Category":  "PowerShell",
        "ID":  59
    },
    {
        "title":  "Parameter Classes: Making parameter-binding user friendly",
        "Speaker":  "Friedrich Weinmann",
        "StartTime":  "2018-04-19 14:55:00",
        "Type":  "Presentation",
        "Track":  3,
        "Slot":  6,
        "abstract":  "Asking for a specific data type as input can be very unintuitive and limiting for the user. Accepting anything and parsing in script however is hard to maintain. Enter Parameter Classes, introducing a flexible data adapter that can dynamically convert input as part of the parameter binding process.",
        "Duration":  60,
        "Category":  "PowerShell",
        "ID":  60
    },
    {
        "title":  "DevSec Defense: How DevOps Practices Can Drive Detection Development For Defenders",
        "Speaker":  "Daniel Bohannon",
        "StartTime":  "2018-04-19 16:05:00",
        "Type":  "Presentation",
        "Track":  1,
        "Slot":  7,
        "abstract":  "Attackers constantly update their tradecraft, forcing defenders to quickly build, tune, deploy \u0026 maintain detections in never-ending sprints. Come see how applying DevOps practices \u0026 frameworks like Pester, ScriptAnalyzer, \u0026 custom fuzzers can drive robust methodology-based detection development.",
        "Duration":  60,
        "Category":  "Security",
        "ID":  61
    },
    {
        "title":  "Azure Automation in production, lessons learned in the field",
        "Speaker":  "Jakob Gottlieb Svendsen",
        "StartTime":  "2018-04-19 16:05:00",
        "Type":  "Presentation",
        "Track":  2,
        "Slot":  7,
        "abstract":  "A great and complete process of working with automation. Includes continous delivery for runbooks, import/Export of automation runbooks and resources such as credentials. and a great way to log all outputs and results from runbooks using OMS for up to 3 years present it using PowerBI.",
        "Duration":  60,
        "Category":  "Azure",
        "ID":  62
    },
    {
        "title":  "Howto: Not get a burnout",
        "Speaker":  "Jeff Wouters",
        "StartTime":  "2018-04-19 16:05:00",
        "Type":  "Presentation",
        "Track":  3,
        "Slot":  7,
        "abstract":  "You hear it every once in a while: Someone that\u0027s sick at home, undergoing a burnout. How do you avoid this yourself? Do you recognize the signs? What are the signs? Can you maintain a work-life balance? Is it the same for everyone? If not, what is it for you?\nIn this lunch break session, Jeff Wouters covers some of these topics that affect all of us, one way or another.",
        "Duration":  60,
        "Category":  "PowerShell",
        "ID":  63
    },
    {
        "title":  "ETL with PowerShell",
        "Speaker":  "Andre Kamman",
        "StartTime":  "2018-04-19 17:15:00",
        "Type":  "Presentation",
        "Track":  1,
        "Slot":  8,
        "abstract":  "Moving data in and out of databases and manipulating it on the fly is called ETL. The tools used in case of SQL Server are mostly based on Integration Services (SSIS). PowerShell could potentially be a big timesaver because a few lines of interpreted code might be a lot easier to write than desigining SSIS packages. But it probably wouldn\u0027t scale that well, the engine in SSIS that moves the data is quite powerfull and you could never achieve similar results in PowerShell. Or could you? Let\u0027s see if we can challenge the champion and have ourselves a little battle. Points can be earned for usability, but also raw speed!",
        "Duration":  60,
        "Category":  "Database",
        "ID":  64
    },
    {
        "title":  "The X factor",
        "Speaker":  "Bartosz Bielawski, Thorsten Butz",
        "StartTime":  "2018-04-19 17:15:00",
        "Type":  "Presentation",
        "Track":  2,
        "Slot":  8,
        "abstract":  "Year after year, Microsoft strengthens it\u0027s effort to provide even more *niX style capabilites. In this co-hosted session Bartek Bielawski and Thorsten Butz will guide you through the continouing story of a unified DevOps world, from PS Core to LinuxKit. ",
        "Duration":  60,
        "Category":  "Core",
        "ID":  65
    },
    {
        "title":  "Reverse DSC - Making SharePoint Admins feel loved again",
        "Speaker":  "Rick Taylor",
        "StartTime":  "2018-04-19 17:15:00",
        "Type":  "Presentation",
        "Track":  3,
        "Slot":  8,
        "abstract":  "For SharePoint, DSC is a sensitive topic.  Because it is idempotent, it may cause some headaches for SharePoint Admins.  REVERSE DSC, however, allows me to do a couple of things: make changes and have those changes reflected in the lower environments and update my documentation at the same time! ",
        "Duration":  60,
        "Category":  "DevOps",
        "ID":  66
    },
    {
        "title":  "SHiPS: Walk-through a bare-metal system configuration",
        "Speaker":  "Ravikanth Chaganti",
        "StartTime":  "2018-04-20 08:30:00",
        "Type":  "Presentation",
        "Track":  1,
        "Slot":  1,
        "abstract":  "PowerShell providers have existed for a long time and the in-box Registry and WSMAN providers are classis examples of how the providers are used. However, creating custom providers is not an easy task as they are implemented only in C#. With the release of open source SHiPS module, it is now possible to implement PowerShell providers as class-based Script modules. In this session, we look at a few examples implemented using SHiPS and understand design and implementation best practices.",
        "Duration":  60,
        "Category":  "PowerShell",
        "ID":  67
    },
    {
        "title":  "Automatisierung der Erstellung von Softwarepaketen mit PowerShell",
        "Speaker":  "Andreas Nick",
        "StartTime":  "2018-04-20 08:30:00",
        "Type":  "Presentation",
        "Track":  2,
        "Slot":  1,
        "abstract":  "Mit Windows 10 1607 erfolgte die Integration von Microsoft Application Virtualization (App-V) in das Betriebssystem. Das ADK aus 1703 bringt nun den auf PowerShell basierenden App-V Autosequencer mit. Hier lernst Du wie das Modul funktioniert und wie Du diese Funktionen nutzen kannst.",
        "Duration":  60,
        "Category":  "Automation",
        "ID":  68
    },
    {
        "title":  "PowerShell Security - what to prioritize?",
        "Speaker":  "David das Neves",
        "StartTime":  "2018-04-20 08:30:00",
        "Type":  "Presentation",
        "Track":  3,
        "Slot":  1,
        "abstract":  "PowerShell Security is a very wide topic. Starting from Signing, Logging, Remoting, Priviliged Access Management moving on to enforced Constrained Language Mode, AMSI, JEA and much more. But where to start and where to end? We will discuss a simplified guideline what needs to be prioritized and how.",
        "Duration":  60,
        "Category":  "Security",
        "ID":  69
    },
    {
        "title":  "PowerShell Empire Strikes Back",
        "Speaker":  "Walter Legowski",
        "StartTime":  "2018-04-20 09:45:00",
        "Type":  "Presentation",
        "Track":  1,
        "Slot":  2,
        "abstract":  "(Re)Building A PowerShell Module for Automated Empire Attacks  ",
        "Duration":  60,
        "Category":  "Security",
        "ID":  70
    },
    {
        "title":  "Test-Driven Infrastructure with Test Kitchen, Chef, and DSC",
        "Speaker":  "Stuart Preston",
        "StartTime":  "2018-04-20 09:45:00",
        "Type":  "Presentation",
        "Track":  2,
        "Slot":  2,
        "abstract":  "Whatever Configuration Management solution you\u0027re going for: Chef, DSC, Puppet, etc Infrastructure as Code shares some challenges and best practices. In this session we\u0027ll introduce you to Test Kitchen, an open-source tool that can help with testing your automation, with Chef and DSC demos.",
        "Duration":  60,
        "Category":  "Pester",
        "ID":  71
    },
    {
        "title":  "Hybrid Lab Automation",
        "Speaker":  "Jan-Hendrik Peters, Raimund Andree",
        "StartTime":  "2018-04-20 09:45:00",
        "Type":  "Presentation",
        "Track":  3,
        "Slot":  2,
        "abstract":  "So you have heard about the big cloud, and want to test scenarios like desaster recovery, failover clusters and so on without touching a GUI? Look no further - we will delve into typical Azure-based Hybrid Cloud scenarios using PowerShell and AutomatedLab.",
        "Duration":  60,
        "Category":  "Azure",
        "ID":  72
    },
    {
        "title":  "Using other languages from PowerShell",
        "Speaker":  "Øyvind Kallstad",
        "StartTime":  "2018-04-20 10:55:00",
        "Type":  "Presentation",
        "Track":  1,
        "Slot":  3,
        "abstract":  "In this session we will take a look at how we can call other languages from PowerShell, as well as how to run native commands from within you PowerShell scripts.",
        "Duration":  60,
        "Category":  "PowerShell",
        "ID":  73
    },
    {
        "title":  "Use your PowerShell skills to extend Ansible workflows - create your own Ansible module for Windows platform",
        "Speaker":  "Wojciech Sciesinski",
        "StartTime":  "2018-04-20 10:55:00",
        "Type":  "Presentation",
        "Track":  2,
        "Slot":  3,
        "abstract":  "Ansible is one of the most popular tools to manage hosts configuration. Usually is used to manage Linux-based nodes but can manage Windows-based machines too. In this case, all that is run on Windows is pure PowerShell code.Under presentation, I\u0027ll show you how you can write your own Ansible module.",
        "Duration":  60,
        "Category":  "PowerShell",
        "ID":  74
    },
    {
        "title":  "Use PowerShell as your language of choice inside Azure Functions",
        "Speaker":  "Andre Kamman",
        "StartTime":  "2018-04-20 10:55:00",
        "Type":  "Presentation",
        "Track":  3,
        "Slot":  3,
        "abstract":  "Sure, there are powershell commands to create and control Azure functions, but what about writing the actual function in PowerShell? PowerShell is a first class language inside functions.  Let\u0027s dive into how this works and write some \"Serverless PoSh\"",
        "Duration":  60,
        "Category":  "Azure",
        "ID":  75
    },
    {
        "title":  "The hitchhiker\u0027s guide to user-friendly module design",
        "Speaker":  "Friedrich Weinmann",
        "StartTime":  "2018-04-20 12:45:00",
        "Type":  "Presentation",
        "Track":  1,
        "Slot":  4,
        "abstract":  "Ever used a module that just felt painful to use? Had to dig through heaps of documentations? Or more likely wished in vain those heaps existed at all? Drowned in a sea of blood (aka Wall of red, severe exceptionitis)? Don\u0027t panic! With this guide you will be able to avoid this in your own modules.",
        "Duration":  60,
        "Category":  "PowerShell",
        "ID":  76
    },
    {
        "title":  "How to satisfy your OCD for and with PowerShell?",
        "Speaker":  "Jeff Wouters",
        "StartTime":  "2018-04-20 12:45:00",
        "Type":  "Presentation",
        "Track":  2,
        "Slot":  4,
        "abstract":  "Everyone writes scripts in their own way. I\u0027ll show you (and share with you) the scripts and tools that I\u0027ve created to satisfy my OCD when it comes to delivering scripts to customers or reviewing those of others. Braces, brackets, indenting... and much more.",
        "Duration":  60,
        "Category":  "Pester",
        "ID":  77
    },
    {
        "title":  "Common mistakes in Pester tests",
        "Speaker":  "Jakub Jareš",
        "StartTime":  "2018-04-20 12:45:00",
        "Type":  "Presentation",
        "Track":  3,
        "Slot":  4,
        "abstract":  "Learn about the mistakes people make when writing tests and how to avoid them. I will show why you should name your tests correctly, remove conditions from them, why test your tests and much more.",
        "Duration":  60,
        "Category":  "Pester",
        "ID":  78
    },
    {
        "title":  "Python for PowerShellistas",
        "Speaker":  "Sergei Vorobev",
        "StartTime":  "2018-04-20 14:00:00",
        "Type":  "Presentation",
        "Track":  1,
        "Slot":  5,
        "abstract":  "Python is another great language and a tool for DevOps! Some problems cannot be solved with scripts alone and python has something to offer when PowerShell is not enough.",
        "Duration":  60,
        "Category":  "PowerShell",
        "ID":  79
    },
    {
        "title":  "Working with Binary Data: Writing your own parser",
        "Speaker":  "Jared Atkinson",
        "StartTime":  "2018-04-20 14:00:00",
        "Type":  "Presentation",
        "Track":  2,
        "Slot":  5,
        "abstract":  "Have you ever tried to read a file only for its content to look like a bunch of gobbledygook? In this workshop we will discuss data structures and some practical strategies for parsing them with PowerShell. By the end of this workshop, you will parse your first binary data structure!!",
        "Duration":  60,
        "Category":  "PowerShell",
        "ID":  80
    },
    {
        "title":  "A matter of trust: Authentication and authorization in the PowerShell",
        "Speaker":  "Thorsten Butz",
        "StartTime":  "2018-04-20 14:00:00",
        "Type":  "Presentation",
        "Track":  3,
        "Slot":  5,
        "abstract":  "You will stumble upon numerous traps in terms of Authentication on (remote) devices in PowerShell: from \"double hop\" errors to session handling, from password management to certificate based logon: mind the gaps! ",
        "Duration":  60,
        "Category":  "Security",
        "ID":  81
    },
    {
        "title":  "Microsoft \u0026 Speakers Grand Finale",
        "Speaker":  "All",
        "StartTime":  "2018-04-20 15:00:00",
        "Type":  "Discussion",
        "Track":  1,
        "Slot":  6,
        "abstract":  "Come-together to end this conference. We\u0027ll discuss any question that may still be open, look at next year, and say farewell!",
        "Duration":  "30",
        "Category":  "All",
        "ID":  82
    }
]
